Revit 2027 API
IFCGuidKey(String) Constructor
 Constructs a new IFCHybridGuid
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCGuidKey(
	string ifcGuid
)
Public Sub New (
	ifcGuid As String
)
public:
IFCGuidKey(
	String^ ifcGuid
)
new :
        ifcGuid : string -> IFCGuidKey
Parameters
ifcGuid String
 IFC Global ID
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCGuidKey Class
IFCGuidKey Overload
Autodesk.Revit.DB.IFC Namespace